/* Кернгиан, Ритчи
Задание 1.3 
Вывод таблицы температур по Фаренгейту и Цельсию
   для fahr = 0, 20, ..., 300;
   версия с вещественной арифметикой и заголовком */

   #include <stdio.h>    // подключение библиотеки стандартного ввода-вывода (для работы с printf и scanf)
int main() // главная функция, с которой начинается выполнение программы
{
    float fahr, celsius; // объявление целочисленной переменных для хранения чисел
    int lower, upper, step;

    lower = 0;    /* Нижняя граница температур в таблице */
    upper = 300;  /* Верхняя граница */
    step = 20;    /* Величина шага */

    fahr = lower;

    /* Вывод заголовка над таблицей */
    printf(" Fahr Celsius\n");
    printf("-------------\n");

    /* Цикл while для вычисления и вывода каждой строки таблицы */
    while (fahr <= upper) {
        /* Вычисление температуры по Цельсию с использованием вещественной арифметики.
           Использование чисел с точкой (5.0, 9.0, 32.0) предотвращает усечение дробной части. */
        celsius = (5.0 / 9.0) * (fahr - 32.0);
        
        /* Форматированный вывод: 
           %3.0f — температура по Фаренгейту в поле шириной 3 символа без знаков после запятой;
           %6.1f — температура по Цельсию в поле шириной 6 символов ровно с одним знаком после запятой. */
        printf("%3.0f %6.1f\n", fahr, celsius);
        
        /* Увеличение текущего значения температуры на величину шага */
        fahr = fahr + step;
    }
}