/* Кернгиан, Ритчи
Задание 1.5
Доработайте программу преобразования температур так, чтобы она
выводила таблицу в обратном порядке, т.е. от 300 градусов до нуля.. */

#include <stdio.h>    // Подключение библиотеки стандартного ввода-вывода

int main(void) // Главная функция программы
{
    int fahr; // Объявление целочисленной переменной для температуры по Фаренгейту

    /* Вывод таблицы температур в обратном порядке */
    for (fahr = 300; fahr >= 0; fahr = fahr - 20) {
        /* Формула перевода из Фаренгейта в Цельсий: C = (5.0/9.0) * (F - 32) */

        /* Форматированный вывод:
           %3d — температура по Фаренгейту в поле шириной 3 символа;
           %6.1f — температура по Цельсию в поле шириной 6 символов
           с одним знаком после запятой. */
        printf("%3d %6.1f\n", fahr, (5.0 / 9.0) * (fahr - 32));
    }

    return 0; // Завершение программы
}
