"""
М. Э. Абрамян Programming Taskbook.
Begin7

Найти длину окружности L и площадь круга S заданного радиуса R:
L = 2·π·R, S= π·R2
.
В качестве значения π использовать 3.14.
"""

# Ввод радиуса и числа пи
R = int(input("Введите радиус R: "))  # Значение радиуса круга
pi = 3.14  # Значение числа π

# Вычисление длины окружности
L = 2 * pi * R  # Формула длины окружности

# Вычисление площади круга
S = pi * R ** 2  # Формула площади круга

# Вывод результатов вычислений
print("Длина окружности L = ", L)
print("Площадь круга S = ", S)
