"""
М. Э. Абрамян Programming Taskbook.
Begin9

Даны два неотрицательных числа a и b. Найти их среднее геометри-
ческое, то есть квадратный корень из их произведения: √a·b.
"""

# Импортируем модуль math для использования функции квадратного корня
import math

# Ввод двух чисел
a = int(input("Введите число a: "))  #Первое число
b = int(input("Введите число b: "))  #Второе число

#Вычисление среднего геометрического

average = math.sqrt(a * b)  # Формула среднего геометрического


# Вывод результатов вычислений
print("Среднее геометрическое = ", average)
