
"""
М. Э. Абрамян Programming Taskbook.
Begin6

Даны длины ребер a, b, c прямоугольного параллелепипеда.
Найти его объем V = a * b * c и площадь поверхности
S = 2 * (a * b + b * c + a * c).
"""

# Ввод длин ребер прямоугольного параллелепипеда
a = int(input("Введите длину ребра a: "))  # Длина первого ребра
b = int(input("Введите длину ребра b: "))  # Длина второго ребра
c = int(input("Введите длину ребра c: "))  # Длина третьего ребра

# Вычисление объема прямоугольного параллелепипеда
v = a * b * c  # Формула объема: V = a * b * c

# Вычисление площади поверхности параллелепипеда
s = 2 * (a * b + b * c + a * c)  # Формула площади поверхности

# Вывод результатов вычислений
print("Объем прямоугольного параллелепипеда V = ", v)
print("Площадь поверхности прямоугольного параллелепипеда S = ", s)
