"""
М. Э. Абрамян Programming Taskbook.
Begin10

Даны два ненулевых числа. Найти сумму, разность, произведение и
частное их квадратов.
"""

# Ввод двух чисел
a = int(input("Введите число a: "))  #Первое число
b = int(input("Введите число b: "))  #Второе число
if a == 0 or b == 0:
    print("Ошибка: числа должны быть ненулевыми.")
else:
    # Вычисление суммы, разности, произведения и частного квадратов
    sum_squares = a**2 + b**2  # Сумма квадратов
    diff_squares = a**2 - b**2  # Разность квадратов
    prod_squares = a**2 * b**2  # Произведение квадратов
    quot_squares = a**2 / b**2  # Частное квадратов

    # Вывод результатов вычислений
    print("Сумма квадратов = ", sum_squares)
    print("Разность квадратов = ", diff_squares)
    print("Произведение квадратов = ", prod_squares)
    print("Частное квадратов = ", quot_squares)

