"""
М. Э. Абрамян Programming Taskbook.
Begin12

Даны катеты прямоугольного треугольника a и b. Найти его гипо-
тенузу c и периметр P:
c = √a2 + b2
P= a + b + c
"""

# Ввод двух чисел
a = int(input("Введите катет a: "))  #Первое число
b = int(input("Введите катет b: "))  #Второе число
#Импорт модуля math для вычисления квадратного корня
import math

    # Вычисление гипотенузы и периметра

c = math.sqrt(a**2 + b**2)  # Вычисление гипотенузы
P = a + b + c  # Вычисление периметра

# Вывод результатов вычислений
print("Гипотенуза = ", c)
print("Периметр = ", P)