"""
М. Э. Абрамян Programming Taskbook.
Begin14

Дана длина L окружности. Найти ее радиус R и площадь S круга,
ограниченного этой окружностью, учитывая, что L = 2·π·R, S= π·R2. В
качестве значения π использовать 3.14.
"""

# Ввод двух чисел
L = int(input("Введите длину окружности: "))  #Длина окружности
pi = 3.14  #Значение числа пи  


    # Вычисление радиуса и площади

R = L / (2 * pi)  # Радиус круга
S = pi * R**2  # Площадь круга

# Вывод результатов вычислений
print("Радиус круга = ", R)
print("Площадь круга = ", S)