"""
М. Э. Абрамян Programming Taskbook.
Begin13

Даны два круга с общим центром и радиусами R1 и R2 (R1 > R2).
Найти площади этих кругов S1 и S2, а также площадь S3 кольца, внешний
радиус которого равен R1, а внутренний радиус равен R2:
S1 = π·(R1)2
S2 = π·(R2)2
S3 = S1− S2.
В качестве значения π использовать 3.14.
"""

# Ввод двух чисел
R1 = int(input("Введите радиус R1: "))  #Первое круг
R2 = int(input("Введите радиус R2: "))  #Второй круг
pi = 3.14  #Значение числа пи  


    # Вычисление площадей кругов и кольца

S1 = pi * R1**2  # Площадь первого круга
S2 = pi * R2**2  # Площадь второго круга
S3 = S1 - S2     # Площадь кольца

# Вывод результатов вычислений
print("Площадь первого круга = ", S1)
print("Площадь второго круга = ", S2)
print("Площадь кольца = ", S3)