"""
М. Э. Абрамян Programming Taskbook.
Begin11

Даны два ненулевых числа. Найти сумму, разность, произведение и
частное их модулей.
"""

# Ввод двух чисел
a = int(input("Введите число a: "))  #Первое число
b = int(input("Введите число b: "))  #Второе число
if a == 0 or b == 0:
    print("Ошибка: числа должны быть ненулевыми.")
else:
    # Вычисление суммы, разности, произведения и частного модулей
    sum_moduli = abs(a) + abs(b)  # Сумма модулей
    diff_moduli = abs(a) - abs(b)  # Разность модулей
    prod_moduli = abs(a) * abs(b)  # Произведение модулей
    quot_moduli = abs(a) / abs(b)  # Частное модулей

    # Вывод результатов вычислений
    print("Сумма модулей = ", sum_moduli)
    print("Разность модулей = ", diff_moduli)
    print("Произведение модулей = ", prod_moduli)
    print("Частное модулей = ", quot_moduli)