"""
М. Э. Абрамян Programming Taskbook.
Begin15

Дана площадь S круга. Найти его диаметр D и длину L окружности,
ограничивающей этот круг, учитывая, что L = 2·π·R, S= π·R2. В качестве
значения π использовать 3.14.
"""

# Ввод двух чисел
S = int(input("Введите площадь круга: "))  #Площадь круга
pi = 3.14  #Значение числа пи  


    # Вычисление диаметра и длины окружности


R = (S / pi) ** 0.5  # Радиус круга
D = 2 * R  # Диаметр круга
L = 2 * pi * R  # Длина окружности

# Вывод результатов вычислений
print("Диаметр круга = ", D)
print("Длина окружности = ", L)