//М. Э. Абрамян Programming Taskbook. 
//Boolean4
//Даны два целых числа: A, B. Проверить истинность высказывания: «Справедливы неравенства A > 2 и B ≤ 3».

#include <stdio.h>    // подключение библиотеки стандартного ввода-вывода (для работы с printf и scanf)
#include <stdbool.h>  // подключение библиотеки для работы с булевым типом bool (содержит значения true и false)

int main() {          // главная функция, с которой начинается выполнение программы
    int A;            // объявление целочисленной переменной A для хранения считываемого числа
    int B;            // объявление целочисленной переменной B для хранения считываемого числа
    // функция scanf считывает целое число (%d) с клавиатуры
    // &A — оператор взятия адреса: передает адрес памяти переменной A, чтобы записать туда введенное значение
    // &B — оператор взятия адреса: передает адрес памяти переменной B, чтобы записать туда введенное значение
    scanf("%d", &A);
    scanf("%d", &B);

    // Вычисляется логическое выражение (A > 2 && B <= 3):
    bool is_valid = (A > 2 && B <= 3); // переменная is_valid будет true, если оба условия верны, иначе false

    // Конструкция условного перехода:
    if (is_valid) {
        // если is_valid равен true, выводим "True"
        // \n — символ переноса строки
        printf("True\n");
    } else {
        // если is_valid равен false, выводим "False"
        printf("False\n");
    }

    return 0;         // завершение работы программы с кодом 0 (сигнал ОС о том, что всё прошло успешно)
}