//М. Э. Абрамян Programming Taskbook. 
//For1
//Даны целые числа K и N (N > 0). Вывести N раз число K.

#include <stdio.h>    // подключение библиотеки стандартного ввода-вывода (для работы с printf и scanf)

int main() {          // главная функция, с которой начинается выполнение программы
    int K;            // объявление целочисленной переменной K для хранения считываемого числа
    int N;            // объявление целочисленной переменной N для хранения считываемого числа

    // функция scanf считывает целое число (%d) с клавиатуры
    // &K — оператор взятия адреса: передает адрес памяти переменной K, чтобы записать туда введенное значение
    scanf("%d", &K);
    scanf("%d", &N);

    for (int i = 0; i < N; i++) {  // цикл for, который выполняется N раз (от 0 до N-1)
        printf("%d\n", K);  // выводит значение K на экран с переходом на новую строку
    }

    return 0;         // завершение работы программы с кодом 0 (сигнал ОС о том, что всё прошло успешно)
}
